<script>
export default {
  name: 'greatWallCards',
  data() {
    return {
      carouselItems: [
        { image: require('../assets/img/pass1.jpg'), title: '居庸关', 
        description: ' “天下九塞”之一，“太行八陉”之八，国家级文物保护单位。居庸关同样号称“天下第一雄关”，与嘉峪关相似，但是两关的东西位置不同，且居庸关比嘉峪关修筑时间更早。关城所在的峡谷，属太行余脉军都山地，西山夹峙，下有巨涧，悬崖峭壁，地形极为险要。居庸关与紫荆关、倒马关、固关并称明朝京西四大名关，其中居庸关、紫荆关、倒马关又称内三关。居庸关是四大重要关卡之一。' },
        { image: require('../assets/img/pass2.jpg'), title: '紫荆关', 
        description: '坐落在河北省保定市易县城西北45千米的紫荆岭上，始建于战国时期，秦、汉称上谷关，东汉名五阮关，宋、金称金坡关，元代以后称紫荆关，与居庸关、倒马关合称为内三关。自古便是进出太行山的交通要冲，位于“太行八陉”的第七陉“蒲阴陉”，天下九塞之第四塞，是兵家必争之地。' },
        { image: require('../assets/img/pass3.jpg'), title: '倒马关', 
        description: '最初于战国时置，称鸿之塞，汉代称常山关，北魏叫铁关，亦名鸿山关，明代以后通称倒马关。现存倒马关城始建于明景泰三年（公元1452年），后于成化元年（公元1465年）又进行了一次大规模的维修，整座关城依地势而建，唐河水由西、北、东三面环绕关城而流，平面呈东西长方形，分为上下两城。' },
        { image: require('../assets/img/pass4.jpg'), title: '平型关', 
        description: '明朝正德六年（公元1511年）修筑明朝内长城时经过平型岭，并在关岭上修建城堡。平型关城虎踞于平型岭南麓，呈正方型，周围九百余丈，南北东各置一门，门额镌刻“平型岭”三个大字（门额现收藏于关堡遗址），南北两侧岭上明长城遗址尚存。' },
        { image: require('../assets/img/pass5.jpg'), title: '偏头关', 
        description: '位于偏关县黄河边，与宁武关、雁门关合称“三关”。偏头关东连丫角山，西濒黄河，因东仰西伏，故名偏头。现存关城为明洪武十三年(1380年)所建，明宣德、天顺、弘治元年、嘉靖六年、隆庆年间均有修建。' },
        { image: require('../assets/img/pass6.jpg'), title: '偏头关', 
        description: '位于山西省忻州市代县县城以北约20公里处的雁门山中，是长城上的重要关隘，以“险”著称，被誉为“中华第一关”，有“天下九塞，雁门为首”之说。与宁武关、偏关合称为“外三关”。' },
        { image: require('../assets/img/pass7.jpg'), title: '娘子关', 
        description: '位于山西省阳泉市平定县东北，由于处于山西、河北两省交界处，扼太行山井陉西口，为晋冀的咽喉要地，是长城的著名关隘，有“三晋门户”和“天下第九关”的称号。娘子关景区总体规划面积45平方千米，景区核心面积15平方千米，因相传唐代平阳公主曾率“娘子军”驻扎在此地而得名。 娘子关属半暖温带半湿润干旱大陆性季风气候，四季分明，夏无酷暑，现存关城建于明代，依山傍水，居高临下，建有关门两座。东门为一般砖券城门，额题“直隶娘子关”，南门“宿将楼”巍然屹立，门洞上额书“京畿藩屏”四字。景区主要景点有娘子关瀑布、平阳湖、娘子关村、英雄纪念碑、千孔崖等。' },
        { image: require('../assets/img/pass8.jpg'), title: '杀虎口', 
        description: '也称西口。位于山西省朔州市右玉县境内，紧邻晋蒙两省交接处，杀虎口两侧高山对峙，地形十分险峻，其东依塘子山，西傍大堡山，两山之间开阔的苍头河谷地，自古便是南北重要通道，大同至呼和浩特的公路，仍经由此地，建于明朝，是明长城北部的关口之一。古称参合口。因其特殊的地理位置，杀虎口闻名遐迩，已有两千多年历史。' },
        { image: require('../assets/img/pass9.jpg'), title: '嘉峪关', 
        description: '号称“天下第一雄关”，位于甘肃省嘉峪关市西5千米处最狭窄的山谷中部，城关两侧的城墙横穿沙漠戈壁，北连黑山悬壁长城，南接天下第一墩，是明长城最西端的关口，历史上曾被称为河西咽喉，因地势险要，建筑雄伟，有连陲锁钥之称。嘉峪关是古代“丝绸之路”的交通要塞，中国长城三大奇观之一（东有山海关、中有镇北台、西有嘉峪关）。嘉峪关始建于明洪武五年（1372年），由内城、外城、罗城、瓮城、城壕和南北两翼长城组成，全长约60千米。长城城台、墩台、堡城星罗棋布，由内城、外城、城壕三道防线组成重叠并守之势，形成五里一燧，十里一墩，三十里一堡，百里一城的防御体系。嘉峪关是世界文化遗产，国家AAAAA级旅游景区，全国重点文物保护单位，全国爱国主义教育示范基地。' },
        { image: require('../assets/img/pass10.jpg'), title: '阳关', 
        description: '位于甘肃省敦煌市西南70千米的古董滩。西汉时设置，与玉门关同为当时对西域的门户，丝绸之路南路必经的关隘。因在玉门关之南，故名。' },
        { image: require('../assets/img/pass11.jpg'), title: '玉门关', 
        description: '在今甘肃省敦煌市西北小方盘城，始置于汉武帝时期，为汉时通往西域各地的门户。元鼎或元封中（公元前116年至前105年）修筑酒泉至玉门间的长城，玉门关当随之设立。玉门关现存城垣完整，总体呈方形，东西长24米，南北宽26.4米，残垣高9.7米，全为黄胶土筑成。面积633平方米，西墙、北墙各开一门。城北坡下有东西大车道，是历史上中原和西域诸国来往及邮驿之路。' },
        { image: require('../assets/img/pass12.jpg'), title: '黄崖关', 
        description: '位于天津市蓟州区北30千米的崇山峻岭之中，全段长城建筑在海拔736米的山脊之上，全长42千米，是中国古长城的一部分，有楼台66座，即敌楼52座，烽火台14座，是京东军事险要之地。黄崖关长城始建于北齐天保七年（556年）， 至唐代，安禄山反唐，曾在这里驻扎他的精锐部队—雄武军， [17]明代，戚继光为蓟辽总兵，镇守蓟州16年，期间重修了黄崖关长城，增建了凤凰楼、八卦街和许多楼台。明永乐年建黄崖口关，成化二年（1466年）建太平寨，后经隆庆、万历年大修，建成正关、水口、东西稍城和砖墩等设施完备的防御工程体系。1985年至1987年，天津市政府重新修复了蓟县（现蓟州区）古长城的黄崖关和太平寨两个开放点。1986年10月，黄崖关长城共完成了三期修复工程。' },
        { image: require('../assets/img/pass13.jpg'), title: '山海关', 
        description: '万里长城－山海关，又称榆关、渝关、临闾关，位于河北省秦皇岛市山海关区东大街1号，是明长城的东北关隘之一，在1990年以前被认为是明长城东端起点，素有中国长城“三大奇观之一”（东有山海关、中有镇北台、西有嘉峪关）、“天下第一关”、“边郡之咽喉，京师之保障”之称，与万里之外的嘉峪关遥相呼应，闻名天下。明洪武十四年（1381年），明太祖朱元璋下令在此筑城建关，遂成为扼东北、华北咽喉要塞的军事重镇，因其依山襟海，故得名山海关。山海关有“天下第一关”的美誉，牌匾为明代著名书法家萧显所书。山海关城周长约4千米，与长城相连，以城为关，城高14米，厚7米，有四座主要城门，多种防御建筑。包括“天下第一关”箭楼、靖边楼、牧营楼、临闾楼、瓮城以及1350延长米的明代平原长城等景观。' }
      ]
    };
  }
}
</script>

<template>
  <el-carousel
    height="400px"
    direction="vertical"
    type="card"
    :autoplay="false"
  >
    <el-carousel-item v-for="(item, index) in carouselItems" :key="index">
      <div class="carousel-content">
        <img :src="item.image" alt="Image" class="carousel-image" />
        <div class="carousel-text">
          <h3>{{ item.title }}</h3>
          <p>{{ item.description }}</p>
        </div>
      </div>
    </el-carousel-item>
  </el-carousel>
</template>

<style scoped>
.el-carousel__item h3 {
  color: #475669;
  margin: 0;
  text-align: center;
}

.el-carousel__item p {
  color: #475669;
  opacity: 0.75;
}

.carousel-content {
  display: flex;
  align-items: center;
  height: 100%;
}

.carousel-image {
  width: 50%; /* 图片宽度占轮播项的一半 */
  height: auto; /* 高度自适应 */
  padding: 10px; /* 图片内边距 */
}

.carousel-text {
  width: 50%; /* 文字说明宽度占轮播项的一半 */
  padding: 10px; /* 文字说明内边距 */
  text-align: left; /* 文字左对齐 */
}

.el-carousel__item:nth-child(2n) {
  background-color: #99a9bf;
}

.el-carousel__item:nth-child(2n + 1) {
  background-color: #d3dce6;
}
</style>